'''ციკლური ძვრა
===================

მასივის გარდაქმნა. მასივის ელემნტების მოძრაობა მარცნივ ან მარჯვნივ.
ციკლური ძვრის ორი სახე არსებობს: მარცხნივ ძვრა და მარჯვნივ ძვრა.

მარცხნივ ძვრა                              მარჯვნივ ძვრა
[0][1][2][3][4]                     |     [0][1][2][3][4] 
                                    |
tmp = [0]                           |     tmp = [4]
   <- <- <- <-                      |      -> -> -> ->
[0][1][2][3][4]                     |     [0][1][2][3][4]
[1][2][3][4][4]                           [0][0][1][2][3]
                                    |
[4] = tmp                           |     [0] = tmp
[1][2][3][4][0]                     |     [4][0][1][2][3]
                                    |
კოპირება ხდება                      |    კოპირება ხდება
მომდევნო ელემენტიდან მიმდინარეში        წინა ელემენტიდან მიმდინარეში

'''

# ---> LEFT SHIFT <---
def left_shift(A:list, NA:int):
  '''ციკლური ძვრა მარცნივ.
     NA ზომის A მასივში ხორციელდება
     ელემენტების დაძვრა მარცხნივ.
        <- <- <- <-
     [0][1][2][3][4]
  '''
  tmp = A[0]
  for i in range(NA-1):
    A[i] = A[i+1]

  A[NA-1] = tmp

  print("\n\n===>LEFT SHIFT<===")
  print(A)


# ---> RIGHT SHIFT <---
def right_shift(A:list, NA:int):
  '''ციკლური ძვრა მარჯვნივ.
     NA ზომის A მასივში ხორციელდება
     ელემენტების დაძვრა მარჯვნივ.
      -> -> -> ->
     [0][1][2][3][4] 
  '''
  tmp = A[NA-1]
  for i in range(NA-2, -1, -1):
    A[i+1] = A[i]
  
  A[0] = tmp

  print("\n\n===>RIGHT SHIFT<===")
  print(A)


# -------------------
N = int(input("Elements in array: "))
arr = [0] * N

print("\nEnter {} values:".format(N))
for i in range(N):
  arr[i] = int(input())

print("\nSource Array:")
print(arr)

left_shift(arr.copy(), N)
right_shift(arr.copy(), N)





# -----------------
input("\nDone!..")
