"""
	ციკლი While()

	ციკლის მოქმედებით ხდება ბლოკის მრავალჯერადი გამეორება.
	while ციკლში ბლოკის მოქმედება ხდება მანამ, სანამ პირობა,
	რომელიც მოთავსებული ციკლის თავში, ჭეშმარიტია. როგორც გახდება მცდარი,
	ციკლის მოქმედება შეწყდება და მართვა გადაეცემა ბლოკის დამთავრების შემდეგ ოპერატორს.
	
	while ციკლის სინტაქსი:
		while პირობა:
			ინსტრუქცია 1
			ინსტრუქცია 2
			ინსტრუქცია 3
			...
			ინსტრუქცია N
	
	while ციკლი ძალიან ჰგავს if სტრუქტურას. განსხვავება ისაა, რომ
	if-ში ბლოკი მხოლოდ ერთხელ სრულდება, while-ში კი მანამ, სანამ
	პირობა ჭეშმარიტია (მრავალჯერ).
	
	შევადაროთ if სტრუქტურა while სტრუქტურას: 
"""

print("===> if statment <===")
spam = 0
if spam < 5:
	print("Hello, world!..")
	spam += 1   # spam = spam + 1


print()
""" კოდის ნაწილი შევცვალოთ while ციკლით: """


print("===> while loop <====")
spam = 0
while spam < 5:
	print("Hello, world!..")
	spam += 1  # spam = spam + 1

print(spam)





# --------------------
input("\nDone!..")
