'''
      ალგორითმები
  ====================
  
  უხეში ძალის მეთოდი
  (Brute force)

  გვაქვს განსაზღვრის არე და მნიშვნელობათა არე.
  მაგალითად: მოცემულია კონკრეტული რიცხვი. ამ რიცხვისთვის გვაქვს ამონახსნთა სიმრავლე.
  გარკვეული პროცედურების გავლის შემდეგ ამონასხნთა სიმრავლიდან ამონახსნს ვარჩევთ სათითაოდ,
  რომელიც მოერგება ამ კონკრეტულ რიცხვს. ამას ეწოდება უხეში ძალის მეთოდი.
  ცხადია, მნიშვნელობათა არიდან მოიძებნება ერთი ამონახსნი.
'''

# ----------------------
def is_simple_number(x):
  ''' ფუნქცია განსაზღვრავს x რიცხვი მარტივია თუ შედგენილი.
      x – მთელი, დადებითი (ნატურალური) რიცხვია.
      რიცხვი თუ მარტივია დაბრუნდება True, წინააღმდეგ შემთხვევაში – False
  '''
  divizor = 2
  while divizor <= x**0.5:
    if x % divizor == 0:
      return False

    divizor += 1
    
  return True


# -----------------------
def factorize_number(x):
  ''' x რიცხვის მარტივ მამრავლებად დაშლა.
      მამრავლებს ბეჭდავს ეკრანზე.
      x – მთელი, დადებითი (ნატურალური) რიცხვია.
  '''
  divizor = 2
  while x > 1:
    if x % divizor == 0:
      print(divizor, end =' ')
      x //= divizor
    else:
      divizor += 1



# ========================
print("Is simple number:", is_simple_number(19))
print()

factorize_number(1024)
print()

factorize_number(999)
print()




# ------------------------
input("\nDone!..")
