'''
  range() ფუნქცია, რომელიც წარმოადგენს არითმეტიკულ პროგრესიას,
  შეგვიძლია ცხადად გადავცეთ დიაპაზონის საზღვრები.

  სინტაქსი:
  range(start, stop, step), სადაც
  start - დიაპაზონის დასაწყისი, stop - დასასრული, step - ბიჯი
  range() თუ მხოლოდ ერთი პარამეტრი წერია, ნიშნავს, რომ დიაპაზონი
  მდებარეობს 0-დან პარამეტრი-1 საზღვრებში.მაგ.:
  range(10) ნიშნავს რიცხვების სიმრავლეს [0, 9] დიაპაზონში (10 არ შედის).
  range(N)  <===>  [0, N-1]

  range(12, 16) ნიშნავს დიაპაზონს 12-დან 15-ის ჩათვლით 1-ის ბიჯით.
  ასეთ შემთხვევაში შეიქმნება რიცხვების სიმრავლე დაწყებული 12-დან და
  ყოველი შემდეგი რიცხვი იქნება 1-ით მეტი 15-ის ჩათვლით: 12, 13, 14, 15.

  range(5, 15, 3) ნიშნავს დიაპაზონს 5-დან 14-ის ჩათვლით 3-ის ბიჯით:
  5, 8, 11, 14.

  range(10, 5, -1)  <===> 10, 9, 8, 7, 6.
  range(10, 0, -1)  <===> 10, 9, 8, 7, 6, 5, 4, 3, 2, 1.
  range(10, -1, -1)  <===> 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0.
  range(10, -5, -1)  <===> 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, -1, -2, -3, -4.
  range(10, -1, -2)  <===> 10, 8, 6, 4, 2, 0.
  
  და ასე შემდეგ.
'''

for i in range(12, 16):
  print(i)

print()

for i in range(0, 10, 2):
  print(i)

print()

for i in range(5, -1, -1):
  print(i)




# ------------------------
input("\nDone!..")